Repository: Deeplace/drupal-a11y
Catalog: translations/a11y.*.po
Languages: ro, ru

source: View A11y simulations
ro: Vezi simulările A11y
ru: Просмотр симуляций предлагаемый A11y

source: User can see the different simulators that the a11y module provides. These are intended to help people understand different accessibility concerns and should not be enabled for general site users unless the intention is teaching about the different conditions.
ro: Utilizatorul poate vedea diferitele simulatoare pe care le oferă modulul a11y. Acestea sunt destinate să ajute oamenii să înțeleagă diferite preocupări legate de accesibilitate și nu ar trebui să fie activate pentru utilizatorii generali ai site-ului, cu excepția cazului în care intenția este de a învăța despre diferitele condiții.
ru: Пользователь может ознакомиться с различными симуляторами, которые предоставляет модуль a11y. Они предназначены для того, чтобы помочь людям понять различные проблемы доступности.

source: Accessibility suite
ru: Набор специальных возможностей

source: Accessibility options
ro: Opțiuni de accesibilitate
ru: Параметры специальных возможностей

source: Accessibility menu
ro: Meniu de accesibilitate
ru: Меню специальных возможностей

source: Adjust the interface to make it easier to use for different conditions.
ro: Reglați interfața pentru a face mai ușor de utilizat pentru diferite condiții.
ru: Настройте интерфейс таким образом, чтобы его было проще использовать в различных условиях.

source: Oversize widget
ro: Widget supradimensionat
ru: Увеличить виджет

source: Text size
ro: Mărime text
ru: Размер текста

source: Increase
ro: Mai mare
ru: Увеличить

source: Contrast
ru: Контраст

source: High
ro: Mare
ru: Повысить

source: Low
ro: Scăzut
ru: Понизить

source: Default
ro: Implicit
ru: По умолчанию

source: Invert
ro: Inversiune
ru: Инверсия

source: Partial
ro: Parțială
ru: Частичная

source: Full
ro: Completă
ru: Полная

source: This can help those with trouble processing rapid screen movements.
ro: Acest lucru îi poate ajuta pe cei cu probleme în procesarea mișcărilor rapide ale ecranului.
ru: Это может помочь тем, у кого возникают проблемы с обработкой быстрых перемещений экрана.

source: Animation
ro: Animațiile
ru: Анимации

source: Disable
ro: Opriți
ru: Остановить

source: Font
ro: Fonturi
ru: Шрифты

source: Readable
ro: Lizibili
ru: Читабельный

source: Cursor
ru: Курсор

source: Small
ro: Mic
ru: Маленький

source: Medium
ro: Mediu
ru: Средний

source: Large
ro: Mare
ru: Большой

source: Reset all
ro: Resetați toate
ru: Сбросить всё

source: Simulators
ro: Simulatoare
ru: Симуляторы

source: Simulate different accessibility conditions. This is useful to see how your site would possibly be viewed by people with different conditions.
ro: Simulați diferite condiții de accesibilitate. Acest lucru este util pentru a vedea cum site-ul dvs. ar putea fi vizualizat de persoane cu condiții diferite.
ru: Имитируйте различные условия доступности. Это полезно для того, чтобы увидеть, как ваш сайт, возможно, будут видеть люди с ограниченными возможностями.

source: Dyslexia
ro: Dislexie
ru: Дислексия

source: This will simulate how a dyslexic might view your material.
ro: Acest lucru va simula modul în care un dislexic ar putea vizualiza materialul dvs.
ru: Это позволит смоделировать, как дислексик может видеть сайт.

source: Field loss
ro: Pierderea câmpului
ru: Потеря поля зрения

source: No field loss
ro: Fără pierderi de câmp
ru: Не выбрано

source: Central loss
ro: Pierderea centrală
ru: Центральная

source: Peripheral loss
ro: Pierderea periferică
ru: Периферическая

source: This will simulate how someone with vision field loss might view your material.
ro: Acest lucru va simula modul în care cineva cu pierderea câmpului vizual ar putea vizualiza materialul dvs.
ru: Это смоделирует, как человек с потерей поля зрения может просматривать ваш материал.

source: No color blindness
ro: Fără daltonism
ru: Не выбрано

source: Achromatopsia
ro: Acromatopsie
ru: Ахроматопсия

source: Achromatomaly
ro: Acromatomalie
ru: Ахроматомалия

source: Deuteranopia
ro: Deuteranopie
ru: Дейтеранопия

source: Deuteranomaly
ro: Deuteranomalie
ru: Дейтераномалия

source: Protanopia
ro: Protanopie
ru: Протанопия

source: Protanomaly
ro: Protanomalie
ru: Протаномалия

source: Tritanopia
ro: Tritanopie
ru: Тританопия

source: Tritanomaly
ro: Tritanomalie
ru: Тританомалия

source: Color blind
ro: Daltonism
ru: Дальтонизм

source: This will simulate different variations of color blindness.
ro: Acest lucru va simula diferite variații ale daltonismului.
ru: Это позволит смоделировать различные вариации дальтонизма.

source: Allow for simulating different accessibility issues. This is useful to see how your site would possibly be viewed by people with different conditions. This is a mode intended for developers and site builders as the modes produce accessibility issues by design to help you empathize.
ro: Permiteți simularea diferitelor probleme de accesibilitate. Acest lucru este util pentru a vedea cum site-ul dvs. ar putea fi vizualizat de persoane cu condiții diferite. Acesta este un mod destinat dezvoltatorilor și constructorilor de site-uri, deoarece modurile produc probleme de accesibilitate prin proiectare pentru a vă ajuta să empatizați.
ru: Позволяют моделировать различные проблемы с ограниченным доступом к контенту. Это полезно, чтобы увидеть, как ваш сайт может восприниматься людьми с различными ограниченными возможностями. Этот режим предназначен для разработчиков и создателей сайтов.

source: Allow dyslexia simulator
ro: Permiteți simulatorul de dislexie
ru: Разрешить имитацию дислексии.

source: This produces an effect to content that attempts to simulate the affects of dyslexia.
ro: Acest lucru produce un efect asupra conținutului care încearcă să simuleze efectele dislexiei.
ru: Это моделирует дислексию.

source: Allow field loss simulator
ro: Permiteți simulatorul de pierdere a câmpului
ru: Разрешить имитацию потери поля зрения

source: This produces an effect to content that attempts to simulate the affects of field loss.
ro: Acest lucru produce un efect asupra conținutului care încearcă să simuleze efectele pierderii câmpului vizual.
ru: Это моделирует последствия потери поля зрения.

source: Allow color blind simulator
ro: Permite simulator de daltonism
ru: Разрешить моделирование дальтонизма

source: Manipulates content to filter it through different types of color blindness.
ro: Manipulează conținutul pentru a-l filtra prin diferite tipuri de daltonism.
ru: Манипулирует контентом, чтобы отфильтровать его с помощью различных типов дальтонизма.

source: Button configuration
ro: Configurare widget
ru: Настройки виджета специальных возможностей

source: Which accessibility options appear in the block.
ro: Ce opțiuni de accesibilitate apar în bloc.
ru: Какие параметры специальных возможностей отображать в блоке.

source: Cookie domain
ro: Domeniul Cookie
ru: Cookie домен

source: Define the scope of the accessibility settings. This way you can keep UX patterns the same across subdomains for example.
ro: Definiți domeniul de aplicare al setărilor de accesibilitate. În acest fel, puteți păstra modelele UX la fel în subdomenii, de exemplu.
ru: Определите область действия настроек специальных возможностей. Таким образом, вы можете, например, сохранить шаблоны UX одинаковыми для всех поддоменов.

source: Allow open dyslexic font
ro: Permiteți deschiderea fontului dislexic
ru: Разрешить использовать другие шрифты

source: This loads a css file that allows the user to forcibly override the font used by your site to be Open dyslexic, a font developed for those with dyslexia. You can find out more at http://opendyslexic.org/
ro: Aceasta Încarcă un fișier css care permite utilizatorului să suprascrie forțat fontul folosit de site-ul dvs. pentru a fi Opendyslexic, un font dezvoltat pentru cei cu dislexie. Puteți afla mai multe la http://opendyslexic.org/
ru: При этом загружается css-файл, который позволяет пользователю принудительно изменить шрифт, используемый на вашем сайте, на Opendyslexic, шрифт, разработанный для людей с дислексией. Вы можете узнать больше на http://opendyslexic.org/ и другие более читабельные шрифты

source: Allow change cursor size
ro: Permiteți modificarea dimensiunii cursorului
ru: Разрешить изменять размер курсора

source: Allow the user to adjust the cursor size
ro: Permiteți utilizatorului să ajusteze dimensiunea cursorului
ru: Разрешить пользователю регулировать размер курсора

source: Allow contrast
ro: Permite contrastul
ru: Разрешить изменение контраста

source: Allow the user to adjust the contrast of your site.
ro: Permiteți utilizatorului să ajusteze contrastul site-ului dvs.
ru: Позвольте пользователю регулировать контрастность вашего сайта.

source: Allow Text resize
ro: Permite redimensionarea textului
ru: Разрешить изменение размера текста

source: Allow the user to adjust the text size of your content.
ro: Permiteți utilizatorului să ajusteze dimensiunea textului conținutului dvs.
ru: Позвольте пользователю регулировать размер текста вашего контента.

source: Allow Oversizing widget
ro: Permite supradimensionarea widget
ru: Разрешить увеличение виджета

source: Allow the user to adjust the widget size.
ro: Permiteți utilizatorului să ajusteze dimensiunea widgetului.
ru: Разрешите пользователю регулировать размер виджета.

source: Allow disabling animation
ro: Permite dezactivarea animației
ru: Разрешить отключение анимации

source: Allow the user to disable css/js animations on your site.
ro: Permiteți utilizatorului să dezactiveze animațiile css / js pe site-ul dvs.
ru: Разрешите пользователю отключать css/js анимацию на вашем сайте.

source: Accessibility settings
ro: Setări de accesibilitate
ru: Настройки специальных возможностей

source: Change which accessibility settings to apply.
ro: Modificați ce setări de accesibilitate să aplicați.
ru: Измените, какие параметры специальных возможностей следует применить.

source: Provides accessibility enhancements useful for any website
ro: Oferă îmbunătățiri de accesibilitate utile pentru orice site web
ru: Предоставляет специальные возможности для веб-сайта

source: Disable simulation
ro: Dezactivați simularea
ru: Отключить имитацию
